---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ViewPublishFailed
source: html/a7b325b0-66f1-943b-d02c-275133e42201.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ViewPublishFailed Property

The following views could not be published.

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewPublishFailed { get; }
```